package core.base;

/**
 * http://www.mallocfree.com/interview/c-5-float.htm
 * http://www1.hrbust.edu.cn/zuzhijigou/metc/material/zcyl/Chap02/2.6.1.htm
 * @author yangqf
 * @version 1.0 2016/11/3
 */
public class FloatTest{
    public static void main(String[] args){
        //浮点数的含义,就是小数点浮动,通过左右移动小数点来表示小数,移动小数点通过科学计数法, 比如10^3 向做移动3个小数点
        System.out.println((12.0f-11.9f));//输出: 0.10000038  这个例子简单些不用对阶
        System.out.println((0.3f-0.1f));//输出: 0.20000002
        //问题为什么0.3f-0.1f不等于0.2f?
        /**
         * 1.IEEE 754
         * 2.带小数的十进制转为二进制,以及二进制科学计数法
         * 3.浮点计算单元计算规则
         * 4.小数二进制转十进制
         */
        //IEEE 754
        //float采用32bit, double采用64bit存储, 格式IEEE 754,定义了二进制表示形式,公式:s ⋅ m ⋅ 2(e − N + 1)
        // IEEE 754 用科学记数法以底数为 2 的小数来表示浮点数。IEEE 浮点数用 1 位表示数字的符号，用 8 位来表示指数，用 23 位来表示尾数，即小数部分
        //符号位S，指数位E和尾数位M
        //单精度格式   |符号(1bit)|指数(8bit)|尾数(23bit)
        //双精度格式   |符号(1bit)|指数(11bit)|尾数(52bit)
        //尾数表示数值, 然后通过指数调节小数点

        //===========
        //带小数的十进制转为二进制,以及二进制科学计数法
        //小数十进制转二进制,  乘2取整，顺序排列, 直到小数部分为0,或者达到想要的精度
        //0.625 --> 0.101
        //5.25 --> 101.01  --> 1.0101*2^2  V = (-1)^s×M×2^E

        //============
        //浮点计算单元计算规则
        //ｘ±ｙ＝(Mｘ*2^(Eｘ－Eｙ)±Mｙ)2Eｙ，　　Eｘ<＝Eｙ , x的阶码小于y的阶码

        //详解0.3f-0.1f为什么不等于0.2f
        //0.3f 单浮点在计算机中的表示,
        //1.转为二进制   一直计算尾数长度至少大于23吧,后面计算后再决定是否进位, 结果为0.01001100110011001100110011001100... 1100循环下去
        //阶码M定义为大于1小于2, 所以移动小数点 1.001100110011001100110011001100...*2^-2 向有移动2个小数点, 当小数整数部分部分0时左移
        //所以M为001100110011001100110011001100... , 单浮点数尾数为23bit,所以保留23bit,看第24为值决定是否进位, 结果00110011001100110011010
        //所以M为00110011001100110011010  E为-2
        //因为指数位是8bit 要表示正数和负数, 所以使用加上固定值127,使用正数表示负数, -2+127=125 二进制-->01111101
        //x所以最终浮点数的最终结果
        //S E        M
        //0 01111101 00110011001100110011010   -->使用Integer.toBinaryString(Float.floatToIntBits(0.3f))输出没有开始的两个0

        //y同理得出0.2f --->
        // S E         M
        // 0 01111011 10011001100110011001101

        //开始做减法,公式ｘ±ｙ＝(Mｘ*2^(Eｘ－Eｙ)±Mｙ)2^Eｙ
        //对阶
        //△E ＝ Eｘ－Eｙ = 125-123=2 不等于0则要移动尾数,使其相等,向左移动高位丢失会造成很大误差,所以采用向做移动,丢弃低位精度影响小
        //右移q位,乘以2^q,需要完成对阶,所以将Ey右移2位 --> 0.0010011001100110011001101

        //尾数求和
        //1.00110011001100110011010
        //+
        //0.0010011001100110011001101
        //1.101100110011001100110101

        //舍入处理
        //1.10110011001100110011011

        //规格化处理


        //最终结果
        //0.20000002f = 0 01111100 10011001100110011001110

        //TODO 计算没有完成
        //浮点数到十进制转换, 小数部分使用2^-1, 2^-2 次方


        //java float 输出精度, 因为M长度为23位, 2^23=8388608,所以最多输入7位,但是最后一位可能是进位,所以是不精确的,前6为是准确的,
        //对于这种误差,如果大量计算累积下来可能也会影响到第6位,所以浮点型用于货币计算不准确

        //因为指数有8bit, 最大值128, 所以单浮点型最大值可以达到2^127 即0x1.fffffeP+127f; // 3.4028235e+38f

        //分析还没有完成,原理懂了很多
        //1.float采用23bit来存储,通过8bit的值来表示小数点移动的位数, 相当于23bit尾数M作为一个基数,然后2^M作为移动小数点位数
        //2.在尾数运算中遇到进位等,精度发生改变

        //最更本原因还是小数转为二进制可能存在无限循环,然后运算会有精度丢失

        float yy = 20014999;
        System.out.println(yy);
        System.out.println(Float.MAX_VALUE);

        //java float数据类型是近似值,不能用于精确比较
        System.out.println((0.3f-0.1f)==0.2f);
        System.out.println((0.3f-0.1f));
        float x1 = 0.3f;
        System.out.println("0.3f = "+Integer.toBinaryString(Float.floatToIntBits(x1)));
        System.out.println("0.1f = "+Integer.toBinaryString(Float.floatToIntBits(0.1f)));
        System.out.println("0.20000002f = "+Integer.toBinaryString(Float.floatToIntBits(0.20000002f)));

        //1001100010110011110010111   25bit
        //规格化 1.001100010110011110010111*2^24  , 所以M=24+127=151=10010111(2进制)
        //尾数长度24为,但是单精度尾数有效位数为23bit, 所以进位001100010110011110010111->00110001011001111001100
        //(-1)^0*1.00110001011001111001100*2^24-->1001100010110011110011000(小数点后面23bit,但是乘以2^24,所以在末尾补一个0)
        //1001100010110011110011000-->20015000, 所以最终结果输出20015000
        //所以浮点数表示的整数,二进制长度大于24位,会有精度丢失问题,所以虽然float表示的范围比int大,但是中间有很多数字是无法表示的
        System.out.println("20014999 binary = "+Integer.toBinaryString(20014999));

        //0 10010111 00110001011001111001100
        //0 151-127=24
        System.out.println("20014999 float binary = "+Integer.toBinaryString(Float.floatToIntBits(20014999)));


        //二进制小数转换成十进制小数
        //0.00011001100110011010=0.10000038  这个转换笔算比较麻烦的
        //
    }
}
